telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "app.h"
#include "board.h"
#include "fsl_clock.h"
#include "fsl_common.h"
#include "fsl_debug_console.h"
#include "fsl_gt911.h"
#include "fsl_i3c.h"
#include "fsl_lpi2c.h"
#include "fsl_ostimer.h"
#include "fsl_port.h"
#include "gauge_render.h"
#include "power_data_source.h"
#include "anomaly_engine.h"
#include "eil_profile.h"
#include "accel4_click.h"
#include "fxls8974cf.h"
#include "ext_flash_recorder.h"

#define TOUCH_I2C LPI2C2
#define TOUCH_I2C_FLEXCOMM_INDEX 2u
#define TOUCH_POINTS 5u
#define TOUCH_INT_PORT PORT4
#define TOUCH_INT_PIN 6u
#define ACCEL_I2C LPI2C3
#define ACCEL_I2C_FLEXCOMM_INDEX 3u
#define TEMP_I3C I3C1
#define TEMP_I3C_INDEX 1u
#define BOARD_TEMP_REG 0x00u
#define TEMP_SENSOR_STATIC_ADDR 0x48u
#define TEMP_SENSOR_DYNAMIC_ADDR 0x08u
#define I3C_BROADCAST_ADDR 0x7Eu
#define I3C_CCC_RSTDAA 0x06u
#define I3C_CCC_SETDASA 0x87u
#define SHIELD_GYRO_ADDR0 0x6Au
#define SHIELD_GYRO_ADDR1 0x6Bu
#define SHIELD_GYRO_REG_WHO_AM_I 0x0Fu
#define SHIELD_GYRO_REG_CTRL1_XL 0x10u
#define SHIELD_GYRO_REG_CTRL2_G 0x11u
#define SHIELD_GYRO_REG_CTRL3_C 0x12u
#define SHIELD_GYRO_REG_OUTX_L_G 0x22u
#define SHIELD_GYRO_REG_OUTX_L_A 0x28u
#define SHIELD_GYRO_REG_FUNC_CFG_ACCESS 0x01u
#define SHIELD_IMU_WHOAMI_LSM6DSO16IS 0x22u
#define SHIELD_IMU_WHOAMI_LSM6DSV16X 0x70u
#define SHIELD_SHUB_FUNC_CFG_ACCESS 0x40u
#define SHIELD_SHUB_REG_SENSOR_HUB_1 0x02u
#define SHIELD_SHUB_REG_MASTER_CONFIG 0x14u
#define SHIELD_SHUB_REG_SLV0_ADD 0x15u
#define SHIELD_SHUB_REG_SLV0_SUBADD 0x16u
#define SHIELD_SHUB_REG_SLV0_CONFIG 0x17u
#define SHIELD_SHUB_REG_DATAWRITE_SLV0 0x21u
#define SHIELD_SHUB_REG_STATUS_MASTER 0x22u
#define SHIELD_SHUB_STATUS_ENDOP 0x01u
#define SHIELD_SHUB_STATUS_NACK_MASK 0x78u
#define SHIELD_SHUB_MASTER_SHUB_PU_EN 0x08u
#define SHIELD_SHUB_MASTER_ON 0x04u
#define SHIELD_SHUB_MASTER_WRITE_ONCE 0x40u
#define SHIELD_SHUB_MASTER_RST_REGS 0x80u
#define SHIELD_LIS2DUXS12_ADDR0 0x18u
#define SHIELD_LIS2DUXS12_ADDR1 0x19u
#define SHIELD_LIS2DUXS12_WHOAMI 0x47u
#define SHIELD_LIS2MDL_ADDR 0x1Eu
#define SHIELD_LIS2MDL_ADDR_ALT 0x1Cu
#define SHIELD_LIS2MDL_REG_WHO_AM_I 0x4Fu
#define SHIELD_LIS2MDL_WHOAMI 0x40u
#define SHIELD_LIS2MDL_REG_CFG_A 0x60u
#define SHIELD_LIS2MDL_REG_CFG_C 0x62u
#define SHIELD_LIS2MDL_REG_OUTX_L 0x68u
#define SHIELD_LPS22DF_ADDR0 0x5Cu
#define SHIELD_LPS22DF_ADDR1 0x5Du
#define SHIELD_LPS22DF_WHOAMI 0xB4u
#define SHIELD_LPS22DF_REG_CTRL1 0x10u
#define SHIELD_LPS22DF_REG_OUT_P_XL 0x28u
#define SHIELD_LPS22DF_PRESS_LSB_PER_HPA 4096
#define SHIELD_SHT40_ADDR0 0x44u
#define SHIELD_SHT40_ADDR1 0x45u
#define SHIELD_SHT40_CMD_MEASURE_LP 0xE0u
#define SHIELD_STTS22H_WHOAMI 0xA0u
#define SHIELD_STTS22H_REG_WHO_AM_I 0x01u
#define SHIELD_STTS22H_REG_CTRL 0x04u
#define SHIELD_STTS22H_REG_TEMP_L 0x06u
#define SHIELD_AUX_POLL_PERIOD_US 150000u

#define TOUCH_POLL_DELAY_US 2000u
#define POWER_TICK_PERIOD_US 1000000u
#define DISPLAY_REFRESH_PERIOD_US 100000u
#define RECPLAY_TICK_PERIOD_US 100000u
#define GYRO_REFRESH_PERIOD_US 100000u
#define ACCEL_LIVE_PERIOD_US 100000u
#define RUNTIME_CLOCK_PERIOD_US 100000u
#define TEMP_REFRESH_PERIOD_US 100000u
#define ACCEL_TEST_LOG_PERIOD_US 1000000u
#define EDGEAI_TIMEBASE_CRYSTAL_HZ 32768u
#define EDGEAI_TIMEBASE_CAL_WINDOW_US 250000u
#ifndef EDGEAI_ENABLE_ACCEL_TEST_LOG
#define EDGEAI_ENABLE_ACCEL_TEST_LOG 0
#endif
#ifndef EDGEAI_ENABLE_SHIELD_SCAN_DIAG
#define EDGEAI_ENABLE_SHIELD_SCAN_DIAG 0
#endif
#ifndef EDGEAI_ENABLE_SHIELD_SENSOR_SCAN_LOG
#define EDGEAI_ENABLE_SHIELD_SENSOR_SCAN_LOG 0
#endif
#ifndef EDGEAI_I2C_RETRY_COUNT
#define EDGEAI_I2C_RETRY_COUNT 3u
#endif
#ifndef EDGEAI_SENSOR_SCAN_MODE
#define EDGEAI_SENSOR_SCAN_MODE 0
#endif

static gt911_handle_t s_touch_handle;
static bool s_touch_ready = false;
static bool s_touch_was_down = false;
static uint32_t s_touch_recover_backoff = 0u;
static bool s_timebase_ready = false;
static uint32_t s_timebase_hz = EDGEAI_TIMEBASE_CRYSTAL_HZ;
static bool s_timebase_use_raw = false;
static bool s_timebase_use_core_cycle = false;
static uint32_t s_core_cycle_prev = 0u;
static uint64_t s_core_cycle_accum = 0u;
static bool s_touch_i2c_inited = false;
static bool s_accel_i2c_inited = false;
static bool s_accel_ready = false;
static fxls8974_dev_t s_accel_dev;
static int16_t s_accel_x_mg = 0;
static int16_t s_accel_y_mg = 0;
static int16_t s_accel_z_mg = 1000;
static bool s_shield_gyro_ready = false;
static uint8_t s_shield_gyro_addr = 0u;
static uint8_t s_shield_gyro_who = 0u;
static bool s_shield_use_touch_bus = true;
static bool s_shield_gyro_missing_logged = false;
static bool s_shield_gyro_read_fail_logged = false;
static uint8_t s_shield_gyro_read_fail_streak = 0u;
static int16_t s_ui_gyro_x = 0;
static int16_t s_ui_gyro_y = 0;
static int16_t s_ui_gyro_z = 0;
static bool s_shield_mag_ready = false;
static bool s_shield_baro_ready = false;
static bool s_shield_sht_ready = false;
static bool s_shield_stts_ready = false;
static bool s_shield_aux_init_done = false;
static bool s_shield_mag_use_shub = false;
static bool s_shield_baro_use_shub = false;
static bool s_shield_stts_use_shub = false;
static bool s_shield_mag_use_touch_bus = true;
static uint8_t s_shield_mag_addr = SHIELD_LIS2MDL_ADDR;
static bool s_shield_baro_use_touch_bus = true;
static bool s_shield_sht_use_touch_bus = true;
static bool s_shield_stts_use_touch_bus = true;
static uint8_t s_shield_baro_addr = 0u;
static uint8_t s_shield_sht_addr = 0u;
static uint8_t s_shield_stts_addr = 0u;
static int16_t s_mag_x_mgauss = 0;
static int16_t s_mag_y_mgauss = 0;
static int16_t s_mag_z_mgauss = 0;
static uint8_t s_shield_mag_reprobe_ticks = 0u;
static int16_t s_baro_dhpa = 10132;
static int16_t s_sht_temp_c10 = 250;
static int16_t s_sht_rh_dpct = 500;
static int16_t s_stts_temp_c10 = 250;
static bool s_temp_ready = false;
static bool s_temp_i3c_inited = false;
static uint8_t s_temp_addr = 0u;
static uint8_t s_temp_c = 25u;
static int16_t s_temp_c10 = 250;
static uint16_t s_limit_g_warn_mg = 12000u;
static uint16_t s_limit_g_fail_mg = 15000u;
static int16_t s_limit_temp_lo_c10 = 0;
static int16_t s_limit_temp_hi_c10 = 700;
static uint16_t s_limit_gyro_dps = 500u;
static uint16_t s_gyro_peak_dps = 0u;
static i3c_bus_type_t s_temp_bus_type = kI3C_TypeI2C;
static power_sample_t s_frame_sample;
static anomaly_output_t s_anom_out;
static bool BoardTempI3CInit(void);
static bool TouchI2CInit(void);
static bool AccelI2CInit(void);
static void ShieldGyroInit(void);
static uint32_t CoreClockHz(void);
static bool ShieldImuSupportsShub(uint8_t who);

typedef struct
{
    uint8_t addr;
    uint8_t reg;
    const char *name;
} diag_probe_t;

