telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
static const diag_probe_t kDiagProbes[] = {
    {0x6Au, 0x0Fu, "IMU_A"},
    {0x6Bu, 0x0Fu, "IMU_B"},
    {0x18u, 0x0Fu, "LIS2DUXS12_A"},
    {0x19u, 0x0Fu, "LIS2DUXS12_B"},
    {0x1Eu, 0x4Fu, "LIS2MDL"},
    {0x5Cu, 0x0Fu, "LPS22DF_A"},
    {0x5Du, 0x0Fu, "LPS22DF_B"},
    {0x44u, 0x89u, "SHT4x_CMD"},
    {0x45u, 0x89u, "SHT4x_CMD_ALT"},
    {0x5Du, 0x0Fu, "STTS22H?"},
    {0x3Cu, 0x4Fu, "LIS2MDL_ALT8"},
};

static void ClockFromDeciseconds(uint32_t ds_total, uint8_t *hh, uint8_t *mm, uint8_t *ss, uint8_t *ds)
{
    uint32_t sec_total = ds_total / 10u;
    uint32_t rem_ds = ds_total % 10u;
    uint32_t hh_v = (sec_total / 3600u) % 24u;
    uint32_t mm_v = (sec_total % 3600u) / 60u;
    uint32_t ss_v = sec_total % 60u;

    if (hh != NULL)
    {
        *hh = (uint8_t)hh_v;
    }
    if (mm != NULL)
    {
        *mm = (uint8_t)mm_v;
    }
    if (ss != NULL)
    {
        *ss = (uint8_t)ss_v;
    }
    if (ds != NULL)
    {
        *ds = (uint8_t)rem_ds;
    }
}

static uint8_t ChannelLevelPct(anomaly_level_t lvl)
{
    if (lvl >= ANOMALY_LEVEL_MAJOR)
    {
        return 100u;
    }
    if (lvl >= ANOMALY_LEVEL_MINOR)
    {
        return 80u;
    }
    if (lvl >= ANOMALY_LEVEL_WATCH)
    {
        return 40u;
    }
    return 5u;
}

static void ApplyAnomalyToFrame(power_sample_t *dst)
{
    const eil_profile_t *profile = EilProfile_Get();
    uint8_t ax = ChannelLevelPct(s_anom_out.channel_level[ANOMALY_CH_AX]);
    uint8_t ay = ChannelLevelPct(s_anom_out.channel_level[ANOMALY_CH_AY]);
    uint8_t az = ChannelLevelPct(s_anom_out.channel_level[ANOMALY_CH_AZ]);
    uint8_t tp = ChannelLevelPct(s_anom_out.channel_level[ANOMALY_CH_TEMP]);
    float w_ax = 1.0f;
    float w_ay = 1.0f;
    float w_az = 1.0f;
    float w_tp = 1.0f;
    float weighted_pct;
    float weight_sum;
    uint8_t maxch = ax;
    int32_t abx;
    int32_t aby;
    int32_t abz;
    uint16_t accel_peak_mg;
    bool accel_warn_hit;
    bool accel_fail_hit;
    bool temp_limit_hit;
    bool temp_fail_hit;
    bool gyro_limit_hit;

    if (dst == NULL)
    {
        return;
    }

    if (ay > maxch)
    {
        maxch = ay;
    }
    if (az > maxch)
    {
        maxch = az;
    }
    if (tp > maxch)
    {
        maxch = tp;
    }

    if (profile != NULL)
    {
        w_ax = profile->weight_ax;
        w_ay = profile->weight_ay;
        w_az = profile->weight_az;
        w_tp = profile->weight_temp_c;
    }
    if (w_ax < 0.0f)
    {
        w_ax = 0.0f;
    }
    if (w_ay < 0.0f)
    {
        w_ay = 0.0f;
    }
    if (w_az < 0.0f)
    {
        w_az = 0.0f;
    }
    if (w_tp < 0.0f)
    {
        w_tp = 0.0f;
    }

    weight_sum = w_ax + w_ay + w_az + w_tp;
    if (weight_sum > 0.0f)
    {
        weighted_pct = ((float)ax * w_ax + (float)ay * w_ay + (float)az * w_az + (float)tp * w_tp) / weight_sum;
    }
    else
    {
        weighted_pct = (float)maxch;
    }
    if (weighted_pct < 0.0f)
    {
        weighted_pct = 0.0f;
    }
    if (weighted_pct > 100.0f)
    {
        weighted_pct = 100.0f;
    }

    dst->anomaly_score_pct = (uint16_t)(weighted_pct + 0.5f);
    dst->connector_risk_pct = ax;
    dst->wire_risk_pct = ay;
    dst->thermal_damage_risk_pct = tp;
    dst->degradation_drift_pct = az;
    dst->thermal_risk_s = 0u;

    abx = (s_accel_x_mg < 0) ? -s_accel_x_mg : s_accel_x_mg;
    aby = (s_accel_y_mg < 0) ? -s_accel_y_mg : s_accel_y_mg;
    abz = (s_accel_z_mg < 0) ? -s_accel_z_mg : s_accel_z_mg;
    accel_peak_mg = (uint16_t)abx;
    if ((uint16_t)aby > accel_peak_mg)
    {
        accel_peak_mg = (uint16_t)aby;
    }
    if ((uint16_t)abz > accel_peak_mg)
    {
        accel_peak_mg = (uint16_t)abz;
    }

    accel_warn_hit = (accel_peak_mg >= s_limit_g_warn_mg);
    accel_fail_hit = (accel_peak_mg >= s_limit_g_fail_mg);
    temp_limit_hit = (s_temp_c10 < s_limit_temp_lo_c10) || (s_temp_c10 > s_limit_temp_hi_c10);
    temp_fail_hit = (s_temp_c10 < (s_limit_temp_lo_c10 - 100)) || (s_temp_c10 > (s_limit_temp_hi_c10 + 100));
    gyro_limit_hit = (s_gyro_peak_dps >= s_limit_gyro_dps);

    if (accel_fail_hit || temp_fail_hit)
    {
        dst->ai_status = AI_STATUS_FAULT;
    }
    else if (accel_warn_hit || temp_limit_hit || gyro_limit_hit)
    {
        dst->ai_status = AI_STATUS_WARNING;
    }
    else if ((profile != NULL) && ((weighted_pct / 100.0f) >= profile->alert_fail))
    {
        dst->ai_status = AI_STATUS_FAULT;
    }
    else if ((profile != NULL) && ((weighted_pct / 100.0f) >= profile->alert_warn))
    {
        dst->ai_status = AI_STATUS_WARNING;
    }
    else if (s_anom_out.overall_level >= ANOMALY_LEVEL_WATCH)
    {
        dst->ai_status = AI_STATUS_WARNING;
    }
    else
    {
        dst->ai_status = AI_STATUS_NORMAL;
    }

    dst->ai_fault_flags = 0u;
}

static void AccelAxisSelfTestLog(void)
{
#if EDGEAI_ENABLE_ACCEL_TEST_LOG
    int32_t ax = s_accel_x_mg;
    int32_t ay = s_accel_y_mg;
    int32_t az = s_accel_z_mg;
    int32_t abx = (ax < 0) ? -ax : ax;
    int32_t aby = (ay < 0) ? -ay : ay;
    int32_t abz = (az < 0) ? -az : az;
    char axis = 'X';
    int32_t val = ax;

    if (aby > abx)
    {
        axis = 'Y';
        val = ay;
        abx = aby;
    }
    if (abz > abx)
    {
        axis = 'Z';
        val = az;
    }

    PRINTF("ACCEL_TEST,DOM=%c%s,X=%d,Y=%d,Z=%d\r\n",
           axis, (val >= 0) ? "+" : "-", (int)ax, (int)ay, (int)az);
#else
    /* Disabled by default to avoid periodic UART blocking in the render loop. */
#endif
}

static void TouchDelayMs(uint32_t delay_ms)
{
    SDK_DelayAtLeastUs(delay_ms * 1000u, CoreClockHz());
}

static bool TimebaseInit(void)
{
    status_t st = CLOCK_SetupOsc32KClocking(kCLOCK_Osc32kToWake);
    uint32_t cfg_hz;
    uint32_t measured_hz = 0u;
    uint64_t t0;
    uint64_t t1;

    CLOCK_AttachClk(kXTAL32K2_to_OSTIMER);
    OSTIMER_Init(OSTIMER0);
    cfg_hz = CLOCK_GetOstimerClkFreq();

    s_timebase_use_core_cycle = false;
    s_timebase_use_raw = false;
    s_timebase_hz = (cfg_hz != 0u) ? cfg_hz : EDGEAI_TIMEBASE_CRYSTAL_HZ;

    /* Calibrate effective OSTIMER tick rate against CPU delay, then quantize to expected divisors. */
    t0 = OSTIMER_GetCurrentTimerValue(OSTIMER0);
    SDK_DelayAtLeastUs(EDGEAI_TIMEBASE_CAL_WINDOW_US, CoreClockHz());
    t1 = OSTIMER_GetCurrentTimerValue(OSTIMER0);
    if (t1 > t0)
    {
        measured_hz = (uint32_t)(((t1 - t0) * 1000000ull) / EDGEAI_TIMEBASE_CAL_WINDOW_US);
    }
    if (measured_hz != 0u)
    {
        /* Accept measured tick rate when plausible; avoid forcing a wrong nominal divisor. */
        if ((measured_hz >= (s_timebase_hz / 2u)) && (measured_hz <= (s_timebase_hz * 2u)))
        {
            s_timebase_hz = measured_hz;
        }
    }

    PRINTF("TIMEBASE: src=ostimer32k setup=%d cfg=%u meas=%u use=%u raw=%u\r\n",
           (int)st,
           (unsigned int)cfg_hz,
           (unsigned int)measured_hz,
           (unsigned int)s_timebase_hz,
           (unsigned int)s_timebase_use_raw);
    s_timebase_ready = true;
    return true;
}

