telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
    if (s_shield_stts_addr != 0u)
    {
        if (s_shield_stts_use_shub)
        {
            (void)ShieldShubWriteReg(s_shield_stts_addr, SHIELD_STTS22H_REG_CTRL, 0x0Cu);
        }
        else
        {
            (void)ShieldBusWriteReg(s_shield_stts_use_touch_bus, s_shield_stts_addr, SHIELD_STTS22H_REG_CTRL, 0x0Cu);
        }
        s_shield_stts_ready = true;
        if (s_shield_stts_use_shub)
        {
            PRINTF("SHIELD_STTS ready bus=SHUB addr=0x%02x\r\n", (unsigned int)s_shield_stts_addr);
        }
        else
        {
            PRINTF("SHIELD_STTS ready bus=%s addr=0x%02x\r\n",
                   s_shield_stts_use_touch_bus ? bus_name[0] : bus_name[1],
                   (unsigned int)s_shield_stts_addr);
        }
    }

    s_shield_aux_init_done = true;
    ShieldAuxSetRenderState();
}

static void ShieldAuxUpdate(void)
{
    uint8_t raw[6];

    if (!s_shield_aux_init_done)
    {
        ShieldAuxInit();
    }
    if (s_shield_mag_ready)
    {
        bool ok = true;
        for (uint32_t i = 0u; i < 6u; i++)
        {
            if (s_shield_mag_use_shub)
            {
                if (!ShieldShubReadRegs(s_shield_mag_addr, (uint8_t)(SHIELD_LIS2MDL_REG_OUTX_L + i), &raw[i], 1u))
                {
                    ok = false;
                    break;
                }
            }
            else if (!ShieldBusRead(s_shield_mag_use_touch_bus, s_shield_mag_addr, (uint8_t)(SHIELD_LIS2MDL_REG_OUTX_L + i), &raw[i], 1u))
            {
                ok = false;
                break;
            }
        }
        if (ok)
        {
            int16_t mx = (int16_t)(((uint16_t)raw[1] << 8) | raw[0]);
            int16_t my = (int16_t)(((uint16_t)raw[3] << 8) | raw[2]);
            int16_t mz = (int16_t)(((uint16_t)raw[5] << 8) | raw[4]);
            s_mag_x_mgauss = (int16_t)((mx * 15) / 10);
            s_mag_y_mgauss = (int16_t)((my * 15) / 10);
            s_mag_z_mgauss = (int16_t)((mz * 15) / 10);
        }
        else
        {
            s_shield_mag_ready = false;
            s_shield_mag_reprobe_ticks = 4u;
        }
    }
    else
    {
        if (s_shield_mag_reprobe_ticks > 0u)
        {
            s_shield_mag_reprobe_ticks--;
        }
        else
        {
            /* Re-scan magnetometer path periodically when unavailable. */
            s_shield_aux_init_done = false;
            ShieldAuxInit();
            s_shield_mag_reprobe_ticks = 4u;
        }
    }

    if (s_shield_baro_ready)
    {
        if ((s_shield_baro_use_shub && ShieldShubReadRegs(s_shield_baro_addr, SHIELD_LPS22DF_REG_OUT_P_XL, raw, 5u)) ||
            (!s_shield_baro_use_shub &&
             ShieldBusRead(s_shield_baro_use_touch_bus, s_shield_baro_addr, SHIELD_LPS22DF_REG_OUT_P_XL, raw, 5u)))
        {
            int32_t p_raw = (int32_t)((((uint32_t)raw[2]) << 16) | (((uint32_t)raw[1]) << 8) | raw[0]);
            if ((p_raw & 0x00800000) != 0)
            {
                p_raw |= (int32_t)0xFF000000;
            }
            s_baro_dhpa = (int16_t)((p_raw * 10) / SHIELD_LPS22DF_PRESS_LSB_PER_HPA);
        }
        else
        {
            s_shield_baro_ready = false;
        }
    }

    if (s_shield_sht_ready)
    {
        uint8_t cmd = SHIELD_SHT40_CMD_MEASURE_LP;
        if (ShieldBusWriteRaw(s_shield_sht_use_touch_bus, s_shield_sht_addr, &cmd, 1u))
        {
            uint16_t raw_t;
            uint16_t raw_rh;
            SDK_DelayAtLeastUs(2500u, CoreClockHz());
            if (ShieldBusReadRaw(s_shield_sht_use_touch_bus, s_shield_sht_addr, raw, 6u) &&
                ShieldSht40CrcOk(&raw[0], raw[2]) &&
                ShieldSht40CrcOk(&raw[3], raw[5]))
            {
                raw_t = (uint16_t)(((uint16_t)raw[0] << 8) | raw[1]);
                raw_rh = (uint16_t)(((uint16_t)raw[3] << 8) | raw[4]);
                s_sht_temp_c10 = (int16_t)(((1750 * (int32_t)raw_t) / 65535) - 450);
                s_sht_rh_dpct = (int16_t)(((1250 * (int32_t)raw_rh) / 65535) - 60);
                if (s_sht_rh_dpct < 0)
                {
                    s_sht_rh_dpct = 0;
                }
                if (s_sht_rh_dpct > 1000)
                {
                    s_sht_rh_dpct = 1000;
                }
            }
            else
            {
                s_shield_sht_ready = false;
            }
        }
        else
        {
            s_shield_sht_ready = false;
        }
    }

    if (s_shield_stts_ready)
    {
        if ((s_shield_stts_use_shub && ShieldShubReadRegs(s_shield_stts_addr, SHIELD_STTS22H_REG_TEMP_L, raw, 2u)) ||
            (!s_shield_stts_use_shub &&
             ShieldBusRead(s_shield_stts_use_touch_bus, s_shield_stts_addr, SHIELD_STTS22H_REG_TEMP_L, raw, 2u)))
        {
            int16_t t_raw = (int16_t)(((uint16_t)raw[1] << 8) | raw[0]);
            s_stts_temp_c10 = (int16_t)(t_raw / 10);
        }
        else
        {
            s_shield_stts_ready = false;
        }
    }

    ShieldAuxSetRenderState();
}

static void __attribute__((unused)) ShieldScanI2CAddresses(bool use_touch_bus, const char *bus_name)
{
    bool found = false;
    PRINTF("SHIELD scan %s addr:", bus_name);
    for (uint8_t addr = 0x08u; addr <= 0x77u; addr++)
    {
        if (ShieldBusProbeAddress(use_touch_bus, addr))
        {
            PRINTF(" 0x%02x", (unsigned int)addr);
            found = true;
        }
    }
    if (!found)
    {
        PRINTF(" none");
    }
    PRINTF("\r\n");
}

static bool __attribute__((unused)) DiagLpi2cInit(LPI2C_Type *base, uint32_t fc_idx, uint32_t baud_hz)
{
    lpi2c_master_config_t cfg;
    uint32_t src_hz;

    if ((base == TOUCH_I2C) && !s_touch_i2c_inited)
    {
        CLOCK_SetClkDiv(kCLOCK_DivFlexcom2Clk, 1u);
        CLOCK_AttachClk(kFRO12M_to_FLEXCOMM2);
    }
    if ((base == ACCEL_I2C) && !s_accel_i2c_inited)
    {
        CLOCK_SetClkDiv(kCLOCK_DivFlexcom3Clk, 1u);
        CLOCK_AttachClk(kFRO12M_to_FLEXCOMM3);
    }

    src_hz = CLOCK_GetLPFlexCommClkFreq(fc_idx);
    if (src_hz == 0u)
    {
        return false;
    }
    LPI2C_MasterGetDefaultConfig(&cfg);
    cfg.baudRate_Hz = baud_hz;
    LPI2C_MasterDeinit(base);
    LPI2C_MasterInit(base, &cfg, src_hz);
    return true;
}

static bool __attribute__((unused)) DiagLpi2cProbeAddr(LPI2C_Type *base, uint8_t addr7)
{
    lpi2c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = addr7;
    xfer.direction = kLPI2C_Write;
    xfer.subaddress = 0u;
    xfer.subaddressSize = 0u;
    xfer.data = NULL;
    xfer.dataSize = 0u;
    return (LPI2C_MasterTransferBlocking(base, &xfer) == kStatus_Success);
}

static bool __attribute__((unused)) DiagLpi2cReadReg(LPI2C_Type *base, uint8_t addr7, uint8_t reg, uint8_t *val)
{
    lpi2c_master_transfer_t xfer;
    if (val == NULL)
    {
        return false;
    }
    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = addr7;
    xfer.direction = kLPI2C_Read;
    xfer.subaddress = reg;
    xfer.subaddressSize = 1u;
    xfer.data = val;
    xfer.dataSize = 1u;
    return (LPI2C_MasterTransferBlocking(base, &xfer) == kStatus_Success);
}

static void __attribute__((unused)) DiagScanLpi2cBus(const char *name, LPI2C_Type *base, uint32_t fc_idx)
{
    static const uint32_t bauds[] = {100000u, 400000u};
    for (uint32_t bi = 0u; bi < (sizeof(bauds) / sizeof(bauds[0])); bi++)
    {
        bool any = false;
        if (!DiagLpi2cInit(base, fc_idx, bauds[bi]))
        {
            PRINTF("DIAG %s %luHz: init_failed\r\n", name, (unsigned long)bauds[bi]);
            continue;
        }
        PRINTF("DIAG %s %luHz addr:", name, (unsigned long)bauds[bi]);
        for (uint8_t addr = 0x08u; addr <= 0x77u; addr++)
        {
            if (DiagLpi2cProbeAddr(base, addr))
            {
                PRINTF(" 0x%02x", (unsigned int)addr);
                any = true;
            }
        }
        if (!any)
        {
            PRINTF(" none");
        }
        PRINTF("\r\n");

        for (uint32_t pi = 0u; pi < (sizeof(kDiagProbes) / sizeof(kDiagProbes[0])); pi++)
        {
            uint8_t who = 0u;
            if (DiagLpi2cReadReg(base, kDiagProbes[pi].addr, kDiagProbes[pi].reg, &who))
            {
                PRINTF("DIAG %s %luHz %s addr=0x%02x reg=0x%02x val=0x%02x\r\n",
                       name,
                       (unsigned long)bauds[bi],
                       kDiagProbes[pi].name,
                       (unsigned int)kDiagProbes[pi].addr,
                       (unsigned int)kDiagProbes[pi].reg,
                       (unsigned int)who);
            }
        }
    }
}

static bool __attribute__((unused)) DiagI3CProbeAddrI2C(uint8_t addr7)
{
    i3c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kI3C_TransferDefaultFlag;
    xfer.slaveAddress = addr7;
    xfer.direction = kI3C_Write;
    xfer.subaddress = 0u;
    xfer.subaddressSize = 0u;
    xfer.data = NULL;
    xfer.dataSize = 0u;
    xfer.busType = kI3C_TypeI2C;
    xfer.ibiResponse = kI3C_IbiRespAck;
    return (I3C_MasterTransferBlocking(TEMP_I3C, &xfer) == kStatus_Success);
}

static void ShieldRunDatastreamDiagnostics(void)
{
#if EDGEAI_ENABLE_SHIELD_SCAN_DIAG
    bool any_i3c = false;
    PRINTF("DIAG start shield datastream scan\r\n");
    DiagScanLpi2cBus("FC2", TOUCH_I2C, TOUCH_I2C_FLEXCOMM_INDEX);
    DiagScanLpi2cBus("FC3", ACCEL_I2C, ACCEL_I2C_FLEXCOMM_INDEX);

