telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
static bool TouchInHelpClose(int32_t x, int32_t y)
{
    int32_t bx1 = GAUGE_RENDER_HELP_PANEL_X1 - 8;
    int32_t bx0 = bx1 - 22;
    int32_t by0 = GAUGE_RENDER_HELP_PANEL_Y0 + 8;
    int32_t by1 = by0 + 22;
    return (x >= bx0) && (x <= bx1) && (y >= by0) && (y <= by1);
}

static bool TouchInHelpNext(int32_t x, int32_t y)
{
    return (x >= GAUGE_RENDER_HELP_NEXT_X0) && (x <= GAUGE_RENDER_HELP_NEXT_X1) &&
           (y >= GAUGE_RENDER_HELP_NEXT_Y0) && (y <= GAUGE_RENDER_HELP_NEXT_Y1);
}

static bool TouchInSettingsModeIndex(int32_t x, int32_t y, uint8_t idx)
{
    int32_t x0 = GAUGE_RENDER_SET_MODE_X0 + (int32_t)idx * (GAUGE_RENDER_SET_MODE_W + GAUGE_RENDER_SET_MODE_GAP);
    int32_t x1 = x0 + GAUGE_RENDER_SET_MODE_W - 1;
    int32_t y0 = GAUGE_RENDER_SET_MODE_Y0;
    int32_t y1 = y0 + GAUGE_RENDER_SET_MODE_H - 1;
    return (x >= x0) && (x <= x1) && (y >= y0) && (y <= y1);
}

static bool TouchInSettingsRunIndex(int32_t x, int32_t y, uint8_t idx)
{
    int32_t x0 = GAUGE_RENDER_SET_RUN_X0 + (int32_t)idx * (GAUGE_RENDER_SET_RUN_W + GAUGE_RENDER_SET_RUN_GAP);
    int32_t x1 = x0 + GAUGE_RENDER_SET_RUN_W - 1;
    int32_t y0 = GAUGE_RENDER_SET_RUN_Y0;
    int32_t y1 = y0 + GAUGE_RENDER_SET_RUN_H - 1;
    return (x >= x0) && (x <= x1) && (y >= y0) && (y <= y1);
}

static bool TouchInSettingsTuneIndex(int32_t x, int32_t y, uint8_t idx)
{
    int32_t x0 = GAUGE_RENDER_SET_TUNE_X0 + (int32_t)idx * (GAUGE_RENDER_SET_TUNE_W + GAUGE_RENDER_SET_TUNE_GAP);
    int32_t x1 = x0 + GAUGE_RENDER_SET_TUNE_W - 1;
    int32_t y0 = GAUGE_RENDER_SET_TUNE_Y0;
    int32_t y1 = y0 + GAUGE_RENDER_SET_TUNE_H - 1;
    return (x >= x0) && (x <= x1) && (y >= y0) && (y <= y1);
}

static bool TouchInSettingsAiIndex(int32_t x, int32_t y, uint8_t idx)
{
    int32_t x0 = GAUGE_RENDER_SET_AI_X0 + (int32_t)idx * (GAUGE_RENDER_SET_AI_W + GAUGE_RENDER_SET_AI_GAP);
    int32_t x1 = x0 + GAUGE_RENDER_SET_AI_W - 1;
    int32_t y0 = GAUGE_RENDER_SET_AI_Y0;
    int32_t y1 = y0 + GAUGE_RENDER_SET_AI_H - 1;
    return (x >= x0) && (x <= x1) && (y >= y0) && (y <= y1);
}

static bool TouchInSettingsLimitsButton(int32_t x, int32_t y)
{
    int32_t x0 = GAUGE_RENDER_SET_LIMIT_BTN_X0;
    int32_t x1 = x0 + GAUGE_RENDER_SET_LIMIT_BTN_W - 1;
    int32_t y0 = GAUGE_RENDER_SET_LIMIT_BTN_Y0;
    int32_t y1 = y0 + GAUGE_RENDER_SET_LIMIT_BTN_H - 1;
    return (x >= x0) && (x <= x1) && (y >= y0) && (y <= y1);
}

static bool TouchInLimitsPanel(int32_t x, int32_t y)
{
    return (x >= GAUGE_RENDER_LIMIT_PANEL_X0) && (x <= GAUGE_RENDER_LIMIT_PANEL_X1) &&
           (y >= GAUGE_RENDER_LIMIT_PANEL_Y0) && (y <= GAUGE_RENDER_LIMIT_PANEL_Y1);
}

static bool TouchInLimitsClose(int32_t x, int32_t y)
{
    int32_t bx1 = GAUGE_RENDER_LIMIT_PANEL_X1 - 8;
    int32_t bx0 = bx1 - 22;
    int32_t by0 = GAUGE_RENDER_LIMIT_PANEL_Y0 + 8;
    int32_t by1 = by0 + 22;
    return (x >= bx0) && (x <= bx1) && (y >= by0) && (y <= by1);
}

static bool TouchInLimitsAdjust(int32_t x, int32_t y, uint8_t *idx_out, bool *increase_out)
{
    for (uint8_t idx = 0u; idx < 5u; idx++)
    {
        int32_t y0 = GAUGE_RENDER_LIMIT_ROW_Y0 + (int32_t)idx * (GAUGE_RENDER_LIMIT_ROW_H + GAUGE_RENDER_LIMIT_ROW_GAP);
        int32_t y1 = y0 + GAUGE_RENDER_LIMIT_ROW_H - 1;
        int32_t minus_x0 = GAUGE_RENDER_LIMIT_MINUS_X0;
        int32_t minus_x1 = minus_x0 + GAUGE_RENDER_LIMIT_MINUS_W - 1;
        int32_t plus_x0 = GAUGE_RENDER_LIMIT_PLUS_X0;
        int32_t plus_x1 = plus_x0 + GAUGE_RENDER_LIMIT_PLUS_W - 1;

        if ((y < y0) || (y > y1))
        {
            continue;
        }

        if ((x >= minus_x0) && (x <= minus_x1))
        {
            *idx_out = idx;
            *increase_out = false;
            return true;
        }
        if ((x >= plus_x0) && (x <= plus_x1))
        {
            *idx_out = idx;
            *increase_out = true;
            return true;
        }
    }

    return false;
}

static void SaveUiSettingsIfReady(bool ext_flash_ok,
                                  anomaly_mode_t mode,
                                  anomaly_tune_t tune,
                                  bool run_live,
                                  bool ai_enabled,
                                  uint16_t g_warn_mg,
                                  uint16_t g_fail_mg,
                                  int16_t temp_low_c10,
                                  int16_t temp_high_c10,
                                  uint16_t gyro_limit_dps)
{
    if (!ext_flash_ok)
    {
        return;
    }
    if (!ExtFlashRecorder_SaveUiSettings((uint8_t)mode,
                                         (uint8_t)tune,
                                         run_live,
                                         ai_enabled,
                                         g_warn_mg,
                                         g_fail_mg,
                                         temp_low_c10,
                                         temp_high_c10,
                                         gyro_limit_dps))
    {
        PRINTF("UI_CFG_SAVE: failed\r\n");
    }
}

static void ApplyLimitAdjustment(uint8_t lim_idx, bool increase)
{
    switch (lim_idx)
    {
        case 0u: /* G warn */
            if (increase)
            {
                if (s_limit_g_warn_mg < 15000u)
                {
                    s_limit_g_warn_mg += 500u;
                }
            }
            else if (s_limit_g_warn_mg > 2000u)
            {
                s_limit_g_warn_mg -= 500u;
            }
            if (s_limit_g_fail_mg <= s_limit_g_warn_mg)
            {
                s_limit_g_fail_mg = (uint16_t)(s_limit_g_warn_mg + 500u);
            }
            break;
        case 1u: /* G fail */
            if (increase)
            {
                if (s_limit_g_fail_mg < 16000u)
                {
                    s_limit_g_fail_mg += 500u;
                }
            }
            else if (s_limit_g_fail_mg > 3000u)
            {
                s_limit_g_fail_mg -= 500u;
            }
            if (s_limit_g_fail_mg <= s_limit_g_warn_mg)
            {
                s_limit_g_warn_mg = (uint16_t)(s_limit_g_fail_mg - 500u);
            }
            break;
        case 2u: /* Temp low */
            if (increase)
            {
                if (s_limit_temp_lo_c10 < 300)
                {
                    s_limit_temp_lo_c10 += 50;
                }
            }
            else if (s_limit_temp_lo_c10 > -200)
            {
                s_limit_temp_lo_c10 -= 50;
            }
            if (s_limit_temp_lo_c10 >= s_limit_temp_hi_c10)
            {
                s_limit_temp_hi_c10 = s_limit_temp_lo_c10 + 50;
            }
            break;
        case 3u: /* Temp high */
            if (increase)
            {
                if (s_limit_temp_hi_c10 < 1000)
                {
                    s_limit_temp_hi_c10 += 50;
                }
            }
            else if (s_limit_temp_hi_c10 > (s_limit_temp_lo_c10 + 50))
            {
                s_limit_temp_hi_c10 -= 50;
            }
            if (s_limit_temp_hi_c10 <= s_limit_temp_lo_c10)
            {
                s_limit_temp_hi_c10 = s_limit_temp_lo_c10 + 50;
            }
            break;
        default: /* Gyro */
            if (increase)
            {
                if (s_limit_gyro_dps < 2000u)
                {
                    s_limit_gyro_dps += 100u;
                }
            }
            else if (s_limit_gyro_dps > 100u)
            {
                s_limit_gyro_dps -= 100u;
            }
            break;
    }

