telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
                if (TouchInLimitsClose(tx, ty))
                {
                    limits_visible = false;
                    GaugeRender_SetLimitsVisible(false);
                    redraw_ui = true;
                    handled_limits = true;
                }
                else if (TouchInLimitsAdjust(tx, ty, &lim_idx, &increase))
                {
                    ApplyLimitAdjustment(lim_idx, increase);
                    SaveUiSettingsIfReady(ext_flash_ok,
                                          anom_mode,
                                          AnomalyEngine_GetTune(),
                                          GaugeRender_IsLiveBannerMode(),
                                          ai_enabled,
                                          s_limit_g_warn_mg,
                                          s_limit_g_fail_mg,
                                          s_limit_temp_lo_c10,
                                          s_limit_temp_hi_c10,
                                          s_limit_gyro_dps);
                    redraw_ui = true;
                    handled_limits = true;
                }

                if (!handled_limits && (in_set || !TouchInLimitsPanel(tx, ty)))
                {
                    limits_visible = false;
                    GaugeRender_SetLimitsVisible(false);
                    redraw_ui = true;
                }
            }
            else if (settings_visible)
            {
                bool handled_setting = false;

                if (TouchInSettingsClose(tx, ty))
                {
                    settings_visible = false;
                    GaugeRender_SetSettingsVisible(false);
                    redraw_ui = true;
                    handled_setting = true;
                }

                for (uint8_t i = 0u; i < 2u; i++)
                {
                    if (!handled_setting && TouchInSettingsModeIndex(tx, ty, i))
                    {
                        anom_mode = (anomaly_mode_t)i;
                        AnomalyEngine_SetMode(anom_mode);
                        train_armed_idle = (anom_mode == ANOMALY_MODE_TRAINED_MONITOR);
                        AnomalyEngine_StopTraining();
                        handled_setting = true;
                        redraw_ui = true;
                        PRINTF("ANOM_MODE,%u\r\n", (unsigned int)anom_mode);
                        SaveUiSettingsIfReady(ext_flash_ok,
                                              anom_mode,
                                              AnomalyEngine_GetTune(),
                                              GaugeRender_IsLiveBannerMode(),
                                              ai_enabled,
                                              s_limit_g_warn_mg,
                                              s_limit_g_fail_mg,
                                              s_limit_temp_lo_c10,
                                              s_limit_temp_hi_c10,
                                              s_limit_gyro_dps);
                        break;
                    }
                }

                if (!handled_setting)
                {
                    for (uint8_t i = 0u; i < 2u; i++)
                    {
                        if (TouchInSettingsRunIndex(tx, ty, i))
                        {
                            bool run_live = (i == 1u);
                            GaugeRender_SetLiveBannerMode(run_live);
                            if (run_live)
                            {
                                GaugeRender_SetRecordMode(false);
                                AnomalyEngine_StopTraining();
                                train_armed_idle = false;
                            }
                            else
                            {
                                train_armed_idle = (anom_mode == ANOMALY_MODE_TRAINED_MONITOR);
                            }
                            handled_setting = true;
                            redraw_ui = true;
                            PRINTF("RUN_MODE,%s\r\n", run_live ? "LIVE" : "TRAIN");
                            SaveUiSettingsIfReady(ext_flash_ok,
                                                  anom_mode,
                                                  AnomalyEngine_GetTune(),
                                                  run_live,
                                                  ai_enabled,
                                                  s_limit_g_warn_mg,
                                                  s_limit_g_fail_mg,
                                                  s_limit_temp_lo_c10,
                                                  s_limit_temp_hi_c10,
                                                  s_limit_gyro_dps);
                            break;
                        }
                    }
                }

                if (!handled_setting)
                {
                    for (uint8_t i = 0u; i < 3u; i++)
                    {
                        if (TouchInSettingsTuneIndex(tx, ty, i))
                        {
                            AnomalyEngine_SetTune((anomaly_tune_t)i);
                            handled_setting = true;
                            redraw_ui = true;
                            PRINTF("ANOM_TUNE,%u\r\n", (unsigned int)i);
                            anom_tune = AnomalyEngine_GetTune();
                            SaveUiSettingsIfReady(ext_flash_ok,
                                                  anom_mode,
                                                  anom_tune,
                                                  GaugeRender_IsLiveBannerMode(),
                                                  ai_enabled,
                                                  s_limit_g_warn_mg,
                                                  s_limit_g_fail_mg,
                                                  s_limit_temp_lo_c10,
                                                  s_limit_temp_hi_c10,
                                                  s_limit_gyro_dps);
                            break;
                        }
                    }
                }

                if (!handled_setting)
                {
                    if (TouchInSettingsAiIndex(tx, ty, 0u))
                    {
                        ai_enabled = false;
                        PowerData_SetAiAssistEnabled(ai_enabled);
                        settings_visible = false;
                        GaugeRender_SetSettingsVisible(false);
                        handled_setting = true;
                        redraw_ui = true;
                        PRINTF("AI_SET,OFF\r\n");
                        SaveUiSettingsIfReady(ext_flash_ok,
                                              anom_mode,
                                              AnomalyEngine_GetTune(),
                                              GaugeRender_IsLiveBannerMode(),
                                              ai_enabled,
                                              s_limit_g_warn_mg,
                                              s_limit_g_fail_mg,
                                              s_limit_temp_lo_c10,
                                              s_limit_temp_hi_c10,
                                              s_limit_gyro_dps);
                    }
                    else if (TouchInSettingsAiIndex(tx, ty, 1u))
                    {
                        ai_enabled = true;
                        PowerData_SetAiAssistEnabled(ai_enabled);
                        settings_visible = false;
                        GaugeRender_SetSettingsVisible(false);
                        handled_setting = true;
                        redraw_ui = true;
                        PRINTF("AI_SET,ON\r\n");
                        SaveUiSettingsIfReady(ext_flash_ok,
                                              anom_mode,
                                              AnomalyEngine_GetTune(),
                                              GaugeRender_IsLiveBannerMode(),
                                              ai_enabled,
                                              s_limit_g_warn_mg,
                                              s_limit_g_fail_mg,
                                              s_limit_temp_lo_c10,
                                              s_limit_temp_hi_c10,
                                              s_limit_gyro_dps);
                    }
                }

                if (!handled_setting)
                {
                    if (TouchInSettingsLimitsButton(tx, ty))
                    {
                        handled_setting = true;
                        redraw_ui = true;
                        settings_visible = false;
                        limits_visible = true;
                        GaugeRender_SetSettingsVisible(false);
                        GaugeRender_SetLimitsVisible(true);
                    }
                }

                if (!handled_setting)
                {
                    if (in_set || !TouchInSettingsPanel(tx, ty))
                    {
                        settings_visible = false;
                        GaugeRender_SetSettingsVisible(false);
                        redraw_ui = true;
                    }
                }

                if (redraw_ui)
                {
                    AnomalyEngine_GetOutput(&s_anom_out);
                    GaugeRender_SetAnomalyInfo((uint8_t)s_anom_out.mode,
                                               (uint8_t)s_anom_out.tune,
                                               s_anom_out.training_active,
                                               s_anom_out.trained_ready,
                                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AX],
                                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AY],
                                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AZ],
                                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_TEMP],
                                               (uint8_t)s_anom_out.overall_level);
                    if (lcd_ok)
                    {
                        GaugeRender_DrawFrame(GetFrameSample(), ai_enabled, PowerData_GetReplayProfile());
                    }
                }
            }
            else if (in_set)
            {
                settings_visible = true;
                help_visible = false;
                limits_visible = false;
                GaugeRender_SetHelpVisible(false);
                GaugeRender_SetLimitsVisible(false);
                GaugeRender_SetSettingsVisible(true);
                redraw_ui = true;
            }
            else if (in_help)
            {
                help_visible = true;
                settings_visible = false;
                limits_visible = false;
                GaugeRender_SetSettingsVisible(false);
                GaugeRender_SetLimitsVisible(false);
                GaugeRender_SetHelpPage(0u);
                GaugeRender_SetHelpVisible(true);
                redraw_ui = true;
                PRINTF("UI_HELP,ON\r\n");
            }

            if (redraw_ui && lcd_ok)
            {
                GaugeRender_DrawFrame(GetFrameSample(), ai_enabled, PowerData_GetReplayProfile());
            }
        }

        if (timeline_changed && lcd_ok)
        {
            GaugeRender_DrawFrame(GetFrameSample(), ai_enabled, PowerData_GetReplayProfile());
        }
        if (timeline_changed && !GaugeRender_IsRecordMode() && !GaugeRender_IsRecordConfirmActive() &&
            !GaugeRender_IsLiveBannerMode() && !train_armed_idle)
        {
            playback_active = ext_flash_ok && ExtFlashRecorder_StartPlayback();
            runtime_elapsed_ds = 0u;
            runtime_displayed_sec = UINT32_MAX;
            runtime_clock_start_ticks = TimebaseNowTicks();
            GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
            PRINTF("EXT_FLASH_PLAY: %s\r\n", playback_active ? "restart" : "no_data");
            if (playback_active && ExtFlashRecorder_GetPlaybackInfo(&play_off, &play_cnt))
            {
                PRINTF("EXT_FLASH_PLAY_INFO: offset=%u count=%u\r\n", (unsigned int)play_off, (unsigned int)play_cnt);
            }
        }
        record_start_request = GaugeRender_ConsumeRecordStartRequest();
        if (record_start_request)
        {
            bool cleared = ext_flash_ok && ExtFlashRecorder_ClearAll();
            if (cleared)
            {
                GaugeRender_SetLiveBannerMode(false);
                GaugeRender_SetRecordMode(true);
                playback_active = false;
                train_armed_idle = false;
                runtime_elapsed_ds = 0u;
                rec_elapsed_ds = 0u;
                runtime_displayed_sec = UINT32_MAX;
                runtime_clock_start_ticks = TimebaseNowTicks();
                GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
                if (anom_mode == ANOMALY_MODE_TRAINED_MONITOR)
                {
                    AnomalyEngine_StartTraining();
                }
                PRINTF("EXT_FLASH_REC: cleared_start\r\n");
                GaugeRender_SetPlayhead(99u, true);
            }
            else
            {
                GaugeRender_SetRecordMode(false);
                playback_active = (!GaugeRender_IsLiveBannerMode()) && ext_flash_ok && ExtFlashRecorder_StartPlayback();
                train_armed_idle = (anom_mode == ANOMALY_MODE_TRAINED_MONITOR);
                runtime_elapsed_ds = 0u;
                runtime_displayed_sec = UINT32_MAX;
                runtime_clock_start_ticks = TimebaseNowTicks();
                GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
                PRINTF("EXT_FLASH_REC: clear_failed\r\n");
            }
            if (lcd_ok)
            {
                GaugeRender_DrawFrame(GetFrameSample(), ai_enabled, PowerData_GetReplayProfile());
            }
        }
        record_stop_request = GaugeRender_ConsumeRecordStopRequest();
        if (record_stop_request)
        {
            GaugeRender_SetRecordMode(false);
            train_armed_idle = (anom_mode == ANOMALY_MODE_TRAINED_MONITOR) && !GaugeRender_IsLiveBannerMode();
            runtime_elapsed_ds = 0u;
            runtime_displayed_sec = UINT32_MAX;
            runtime_clock_start_ticks = TimebaseNowTicks();
            GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
            PRINTF("EXT_FLASH_REC: stop_confirmed\r\n");
            if (lcd_ok)
            {
                GaugeRender_DrawFrame(GetFrameSample(), ai_enabled, PowerData_GetReplayProfile());
            }
        }
        s_touch_was_down = pressed;
        modal_active_now = GaugeRender_IsRecordConfirmActive() || help_visible || settings_visible || limits_visible;
        record_mode = GaugeRender_IsRecordMode();
        if (GaugeRender_IsLiveBannerMode())
        {
            playback_active = false;
        }
        if (record_mode != prev_record_mode)
        {
            if (!record_mode)
            {
                if (anom_mode == ANOMALY_MODE_TRAINED_MONITOR)
                {
                    if (s_anom_out.trained_ready)
                    {
                        AnomalyEngine_StopTraining();
                    }
                }
                playback_active = (!GaugeRender_IsLiveBannerMode()) && ext_flash_ok && ExtFlashRecorder_StartPlayback();
                runtime_elapsed_ds = 0u;
                runtime_displayed_sec = UINT32_MAX;
                runtime_clock_start_ticks = TimebaseNowTicks();
                GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
                PRINTF("EXT_FLASH_PLAY: %s\r\n", playback_active ? "ready" : "no_data");
                if (playback_active && ExtFlashRecorder_GetPlaybackInfo(&play_off, &play_cnt))
                {
                    PRINTF("EXT_FLASH_PLAY_INFO: offset=%u count=%u\r\n", (unsigned int)play_off, (unsigned int)play_cnt);
                }
            }
            else
            {
                GaugeRender_SetLiveBannerMode(false);
                if (anom_mode == ANOMALY_MODE_TRAINED_MONITOR)
                {
                    AnomalyEngine_StartTraining();
                }
                playback_active = false;
                runtime_elapsed_ds = 0u;
                rec_elapsed_ds = 0u;
                runtime_displayed_sec = UINT32_MAX;
                runtime_clock_start_ticks = TimebaseNowTicks();
                GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
                PRINTF("EXT_FLASH_REC: active\r\n");
                if (ext_flash_ok && ExtFlashRecorder_GetRecordInfo(&rec_cnt))
                {
                    PRINTF("EXT_FLASH_REC_INFO: count=%u\r\n", (unsigned int)rec_cnt);
                }
                GaugeRender_SetPlayhead(99u, true);
            }
            prev_record_mode = record_mode;
        }

        {
            uint32_t elapsed_loop_us;
            if (s_timebase_ready)
            {
                uint64_t now_ticks = TimebaseNowTicks();
                uint64_t dt_ticks = now_ticks - time_prev_ticks;
                uint64_t us_num = (dt_ticks * 1000000ull) + time_us_rem;
                time_prev_ticks = now_ticks;
                elapsed_loop_us = (uint32_t)(us_num / s_timebase_hz);
                time_us_rem = us_num % s_timebase_hz;
            }
            else
            {
                elapsed_loop_us = TOUCH_POLL_DELAY_US;
            }

            if (elapsed_loop_us == 0u)
            {
                elapsed_loop_us = TOUCH_POLL_DELAY_US;
            }
            if (elapsed_loop_us > 250000u)
            {
                elapsed_loop_us = 250000u;
            }

            runtime_clock_tick_accum_us += elapsed_loop_us;
            data_tick_accum_us += elapsed_loop_us;
            recplay_tick_accum_us += elapsed_loop_us;
            render_tick_accum_us += elapsed_loop_us;
            gyro_tick_accum_us += elapsed_loop_us;
            accel_live_tick_accum_us += elapsed_loop_us;
            temp_tick_accum_us += elapsed_loop_us;
            shield_aux_tick_accum_us += elapsed_loop_us;
            accel_test_tick_accum_us += elapsed_loop_us;

