telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
            if (data_tick_accum_us > (POWER_TICK_PERIOD_US * 2u))
            {
                data_tick_accum_us = POWER_TICK_PERIOD_US * 2u;
            }
            if (recplay_tick_accum_us > (RECPLAY_TICK_PERIOD_US * 2u))
            {
                recplay_tick_accum_us = RECPLAY_TICK_PERIOD_US * 2u;
            }
            if (render_tick_accum_us > (DISPLAY_REFRESH_PERIOD_US * 2u))
            {
                render_tick_accum_us = DISPLAY_REFRESH_PERIOD_US * 2u;
            }
            if (temp_tick_accum_us > (TEMP_REFRESH_PERIOD_US * 2u))
            {
                temp_tick_accum_us = TEMP_REFRESH_PERIOD_US * 2u;
            }
            if (shield_aux_tick_accum_us > (SHIELD_AUX_POLL_PERIOD_US * 2u))
            {
                shield_aux_tick_accum_us = SHIELD_AUX_POLL_PERIOD_US * 2u;
            }
            if (accel_test_tick_accum_us > (ACCEL_TEST_LOG_PERIOD_US * 2u))
            {
                accel_test_tick_accum_us = ACCEL_TEST_LOG_PERIOD_US * 2u;
            }
        }

        while (gyro_tick_accum_us >= GYRO_REFRESH_PERIOD_US)
        {
            gyro_tick_accum_us -= GYRO_REFRESH_PERIOD_US;
            if (lcd_ok)
            {
                if (!train_armed_idle)
                {
                    ShieldGyroUpdate();
                    if (!modal_active_now)
                    {
                        GaugeRender_DrawGyroFast();
                    }
                }
            }
        }

        while (accel_live_tick_accum_us >= ACCEL_LIVE_PERIOD_US)
        {
            accel_live_tick_accum_us -= ACCEL_LIVE_PERIOD_US;
            /* Gyro/accel live update now runs in the gyro refresh loop above. */
        }

        while (shield_aux_tick_accum_us >= SHIELD_AUX_POLL_PERIOD_US)
        {
            shield_aux_tick_accum_us -= SHIELD_AUX_POLL_PERIOD_US;
            if (!train_armed_idle)
            {
                ShieldAuxUpdate();
            }
        }

        while (runtime_clock_tick_accum_us >= RUNTIME_CLOCK_PERIOD_US)
        {
            runtime_clock_tick_accum_us -= RUNTIME_CLOCK_PERIOD_US;
            if (!record_mode && !playback_active)
            {
                uint32_t elapsed_sec;
                if (s_timebase_ready && (s_timebase_hz != 0u))
                {
                    uint64_t now_ticks = TimebaseNowTicks();
                    uint64_t dt_ticks = (now_ticks >= runtime_clock_start_ticks) ? (now_ticks - runtime_clock_start_ticks) : 0u;
                    elapsed_sec = (uint32_t)(dt_ticks / s_timebase_hz);
                    runtime_elapsed_ds = elapsed_sec * 10u;
                }
                else
                {
                    runtime_elapsed_ds++;
                    elapsed_sec = runtime_elapsed_ds / 10u;
                }

                if (elapsed_sec != runtime_displayed_sec)
                {
                    uint8_t ch, cm, cs, cds;
                    ClockFromDeciseconds(elapsed_sec * 10u, &ch, &cm, &cs, &cds);
                    GaugeRender_SetRuntimeClock(ch, cm, cs, 0u, true);
                    runtime_displayed_sec = elapsed_sec;
                }
            }
        }

        if (data_tick_accum_us >= POWER_TICK_PERIOD_US)
        {
            data_tick_accum_us -= POWER_TICK_PERIOD_US;
            PowerData_Tick();
        }

        if (recplay_tick_accum_us >= RECPLAY_TICK_PERIOD_US)
        {
            recplay_tick_accum_us -= RECPLAY_TICK_PERIOD_US;
            if (ext_flash_ok && record_mode && !GaugeRender_IsLiveBannerMode())
            {
                uint32_t rec_sec;
                if (s_timebase_ready && (s_timebase_hz != 0u))
                {
                    uint64_t now_ticks = TimebaseNowTicks();
                    uint64_t dt_ticks = (now_ticks >= runtime_clock_start_ticks) ? (now_ticks - runtime_clock_start_ticks) : 0u;
                    rec_elapsed_ds = (uint32_t)((dt_ticks * 10ull) / s_timebase_hz);
                }
                else
                {
                    rec_elapsed_ds++;
                }
                rec_sec = rec_elapsed_ds / 10u;

                if (!ExtFlashRecorder_AppendSampleEx(s_accel_x_mg,
                                                     s_accel_y_mg,
                                                     s_accel_z_mg,
                                                     s_ui_gyro_x,
                                                     s_ui_gyro_y,
                                                     s_ui_gyro_z,
                                                     s_temp_c10,
                                                     s_mag_x_mgauss,
                                                     s_mag_y_mgauss,
                                                     s_mag_z_mgauss,
                                                     s_baro_dhpa,
                                                     s_sht_temp_c10,
                                                     s_sht_rh_dpct,
                                                     s_stts_temp_c10,
                                                     rec_elapsed_ds))
                {
                    PRINTF("EXT_FLASH_REC: write_failed\r\n");
                }
                else
                {
                    uint8_t ch, cm, cs, cds;
                    ClockFromDeciseconds(rec_sec * 10u, &ch, &cm, &cs, &cds);
                    GaugeRender_SetRuntimeClock(ch, cm, cs, 0u, true);
                    runtime_displayed_sec = rec_sec;
                    GaugeRender_SetPlayhead(99u, true);
                }
            }
            else if (playback_active)
            {
                if (ExtFlashRecorder_ReadNextSample(&playback_sample))
                {
                    s_accel_x_mg = playback_sample.ax_mg;
                    s_accel_y_mg = playback_sample.ay_mg;
                    s_accel_z_mg = playback_sample.az_mg;
                    GaugeRender_SetLinearAccel(s_accel_x_mg, s_accel_y_mg, s_accel_z_mg, true);
                    GaugeRender_SetAccel(playback_sample.gx_mdps, playback_sample.gy_mdps, playback_sample.gz_mdps, true);
                    s_mag_x_mgauss = playback_sample.mag_x_mgauss;
                    s_mag_y_mgauss = playback_sample.mag_y_mgauss;
                    s_mag_z_mgauss = playback_sample.mag_z_mgauss;
                    s_baro_dhpa = playback_sample.baro_dhpa;
                    s_sht_temp_c10 = playback_sample.sht_temp_c10;
                    s_sht_rh_dpct = playback_sample.sht_rh_dpct;
                    s_stts_temp_c10 = playback_sample.stts_temp_c10;
                    GaugeRender_SetMag(s_mag_x_mgauss, s_mag_y_mgauss, s_mag_z_mgauss, true);
                    GaugeRender_SetBaro(s_baro_dhpa, true);
                    GaugeRender_SetSht(s_sht_temp_c10, s_sht_rh_dpct, true);
                    GaugeRender_SetStts(s_stts_temp_c10, true);
                    s_temp_c10 = playback_sample.temp_c10;
                    s_temp_c = playback_sample.temp_c;
                    s_temp_ready = true;
                    GaugeRender_SetBoardTempC10(s_temp_c10, true);
                    {
                        uint8_t ch, cm, cs, cds;
                        uint32_t play_sec = playback_sample.ts_ds / 10u;
                        ClockFromDeciseconds(play_sec * 10u, &ch, &cm, &cs, &cds);
                        GaugeRender_SetRuntimeClock(ch, cm, cs, 0u, true);
                        runtime_displayed_sec = play_sec;
                    }
                    if (ExtFlashRecorder_GetPlaybackInfo(&play_off, &play_cnt) && (play_cnt > 0u))
                    {
                        uint32_t pos = (play_off * 100u) / play_cnt;
                        if (pos > 99u)
                        {
                            pos = 99u;
                        }
                        GaugeRender_SetPlayhead((uint8_t)pos, true);
                    }
                }
                else
                {
                    playback_active = false;
                    if ((anom_mode == ANOMALY_MODE_TRAINED_MONITOR) && s_anom_out.training_active && !s_anom_out.trained_ready)
                    {
                        playback_active = ext_flash_ok && ExtFlashRecorder_StartPlayback();
                        if (playback_active)
                        {
                            PRINTF("AI_TRAIN: replay_restart\r\n");
                        }
                        else
                        {
                            AnomalyEngine_StopTraining();
                            PRINTF("AI_TRAIN: replay_unavailable\r\n");
                        }
                    }
                    else
                    {
                        PRINTF("EXT_FLASH_PLAY: read_failed\r\n");
                    }
                }
            }

            AnomalyEngine_Update(s_accel_x_mg, s_accel_y_mg, s_accel_z_mg, s_temp_c10);
            AnomalyEngine_GetOutput(&s_anom_out);
            if (!prev_trained_ready && s_anom_out.trained_ready)
            {
                /* Automatically promote to LIVE once model fit is complete on-board. */
                GaugeRender_SetLiveBannerMode(true);
                GaugeRender_SetRecordMode(false);
                playback_active = false;
                AnomalyEngine_StopTraining();
                SaveUiSettingsIfReady(ext_flash_ok,
                                      anom_mode,
                                      AnomalyEngine_GetTune(),
                                      true,
                                      ai_enabled,
                                      s_limit_g_warn_mg,
                                      s_limit_g_fail_mg,
                                      s_limit_temp_lo_c10,
                                      s_limit_temp_hi_c10,
                                      s_limit_gyro_dps);
                PRINTF("AI_TRAIN: complete_live\r\n");
            }
            prev_trained_ready = s_anom_out.trained_ready;
            GaugeRender_SetAnomalyInfo((uint8_t)s_anom_out.mode,
                                       (uint8_t)s_anom_out.tune,
                                       s_anom_out.training_active,
                                       s_anom_out.trained_ready,
                                       (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AX],
                                       (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AY],
                                       (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AZ],
                                       (uint8_t)s_anom_out.channel_level[ANOMALY_CH_TEMP],
                                       (uint8_t)s_anom_out.overall_level);
        }

        if (temp_tick_accum_us >= TEMP_REFRESH_PERIOD_US)
        {
            temp_tick_accum_us -= TEMP_REFRESH_PERIOD_US;
            if (!train_armed_idle)
            {
                BoardTempUpdate();
            }
        }

        if (accel_test_tick_accum_us >= ACCEL_TEST_LOG_PERIOD_US)
        {
            accel_test_tick_accum_us -= ACCEL_TEST_LOG_PERIOD_US;
            if (s_accel_ready)
            {
                AccelAxisSelfTestLog();
            }
        }

        if (lcd_ok && (render_tick_accum_us >= DISPLAY_REFRESH_PERIOD_US))
        {
            render_tick_accum_us -= DISPLAY_REFRESH_PERIOD_US;
            if (!modal_active_now)
            {
                GaugeRender_DrawFrame(GetFrameSample(), ai_enabled, PowerData_GetReplayProfile());
            }
        }

        DelayUsByTimebase(TOUCH_POLL_DELAY_US);
    }
#endif
}
